# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
#brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'gh'
#brew 'gnupg'
#brew 'grep'
#brew 'httpie'
#brew 'hub'
#brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

#Customize terminal
brew 'romkatv/powerlevel10k/powerlevel10k'
brew  'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
# brew 'composer'
# brew 'libmemcached'
# brew 'meilisearch'
# brew 'memcached'


# Apps
cask '1password'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'zoom'
cask 'cleanmymac'
cask 'adobe-acrobat-pro'
cask 'adobe-acrobat-reader'
cask 'whatsapp'
cask 'iterm2'
cask 'notion'
cask 'spotify'
# cask 'sizzy'
cask 'recordit'
cask 'vlc'
cask 'loom'
cask 'calibre'

# cask 'caffeine'
# cask 'dbngin'
# cask 'docker'
# cask 'github'
# cask 'google-drive'
# cask 'gpg-suite'
# cask 'imageoptim'
# cask 'insomnia'
# cask 'pastebot'
# cask 'phpmon'
# cask 'phpstorm'
# cask 'ray'
# cask 'screenflow'
# cask 'signal'
# cask 'tinkerwell'
# cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlcolorcode'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-victor-mono'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Magnet', id: 441258766
